{"id":13054,"date":"2021-02-08T13:53:31","date_gmt":"2021-02-08T19:53:31","guid":{"rendered":"https:\/\/www.brightscout.com\/?p=13054"},"modified":"2021-02-08T13:55:16","modified_gmt":"2021-02-08T19:55:16","slug":"comprehensive-guide-to-kpi-metrics-tracking-for-web-and-mobile-applications","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/comprehensive-guide-to-kpi-metrics-tracking-for-web-and-mobile-applications\/","title":{"rendered":"Comprehensive Guide to KPI Metrics Tracking for Web and Mobile Applications"},"content":{"rendered":"<p>When it comes to app development, one of the most important things you must do is track KPIs. This ultimate guide will review everything you need to know about app metrics, such as what they are and which ones you should use to measure the success of your app.<\/p>\n<p><!--more--><\/p>\n<h2>What are KPI Metrics?<\/h2>\n<p>KPI refers to a key performance indicator. This is a calculated or measured figure that provides valuable insight into your app&#8217;s performance and growth. In fact, you should understand the relevant metrics that you will need before you start developing your software.<\/p>\n<p>These metrics can help your company evaluate successes and pinpoint areas that need improvement. Low-level KPIs can measure individual departments like sales or marketing, while higher-level metrics can gauge your progress towards your overall business goals.<\/p>\n<p>Make sure that you incorporate relevant KPIs into your development and marketing plans, including which ones will be most important to your success.<\/p>\n<h2>How to Measure App Performance<\/h2>\n<p>So, how exactly can you measure app performance?<\/p>\n<p>The key here is having analytics tools in place that can gather as much data about your platform as possible. This includes things like download rates, customer reviews, revenue and cost tracking, and more.<\/p>\n<p>Once you have all the data, you can perform calculations and benchmarking to see how your app stacks up to your goals and forecasts. To do this properly, you need to be thinking about data collection well before you get started during development – get the structure in place so that you can start processing the information as soon as you launch your app.<\/p>\n<h2>The Importance of KPIs<\/h2>\n<p>Measuring KPIs is invaluable when it comes to app development. Tracking these metrics allows you to not only reflect on the progress your app has made so far, but also allows you to gather important information that can help you improve marketing, boost revenues, or increase customer engagement.<\/p>\n<p>For instance, if your monthly average users are dropping, it may be that your marketing strategy needs to be updated or tweaked.<\/p>\n<h2>KPI Metrics for Web and Mobile Applications<\/h2>\n<p>There are many different metrics you can track for web and mobile applications. Let’s break these down into four separate segments: acquisition metrics, engagement metrics, performance metrics, and revenue metrics.<\/p>\n<h3>Acquisition Metrics<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13062\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/acquisition-metric-1024x625.jpg\" alt=\"\" width=\"1024\" height=\"625\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/acquisition-metric-980x598.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/acquisition-metric-480x293.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>Acquisition KPIs are all about how you attract new users to your application. Even with the best app design, you will not be successful if you can’t get people to download it and register to use it!<\/p>\n<p>Here are some of the most important acquisition KPIs:<\/p>\n<h4><strong>a. User Growth Rate<\/strong><\/h4>\n<p>The user growth rate is an app KPI that measures if your user base is growing. If it is growing, it can indicate what is driving it. By measuring the changes in user growth rates after pricing adjustment, app updates, or new marketing efforts, you can see the impact it has on the metric.<\/p>\n<p>To calculate this, you will need to measure the change in users as a percentage:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13057\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/Screen-Shot-2021-02-08-at-2.03.01-PM-1024x117.png\" alt=\"\" width=\"861\" height=\"98\" \/><\/p>\n<p>For example, let’s assume that you have 10,000 users this month, compared to 8,000 last month. Your user growth rate would be calculated by taking 10,000 and subtracting 8,000, then dividing it by 8,000. This means your users grew at a rate of 25% this month!<\/p>\n<h4><strong>b. Downloads\/Registration<\/strong><\/h4>\n<p>App downloads and registrations measure how many times your software is downloaded to a device, and how many people sign up to use it, respectively.<\/p>\n<p>You will often see total downloads shown on the app store. This is an important measure to track, however, it does not directly correlate with the success of your product. According to <a href=\"https:\/\/www.appsflyer.com\/blog\/new-data-shows-uninstalls-remain-significant-pain-apps\/\">AppsFlyer<\/a>, 28% of apps are uninstalled within the first month of download – so collect the data for calculating other metrics, but take it with a grain of salt.<br \/>\nRegistration takes downloads a step further. It only counts users that downloaded the app and shared their personal information to create an account and register. While this is a better indicator than downloads alone, it still will not paint a complete picture on its own!<\/p>\n<h4><strong>c. Geographics<\/strong><\/h4>\n<p>Geographics in app design refers to where your users are located. Geography will dictate things like languages used and in-app purchases, so tracking this is important!<\/p>\n<p>Understanding where the bulk of your users are located can help you tailor marketing campaigns and ensure that you are reaching the right people, but it can also highlight areas of opportunity where the market may not yet be saturated.<\/p>\n<h4><strong>d. Demographics<\/strong><\/h4>\n<p>Another key metric in app development is the demographics of your target audience. This includes everything from age and gender to ethnicity, income levels, and lifestyles.<\/p>\n<p>When you track your customer demographics, you can start to understand their unique needs and develop precise marketing to target them. Similarly, by comparing the demographics of your actual user-base to your target audience, you can see how effective your ad campaigns have been.<\/p>\n<h4><strong>e. Channel Sources (Attribution)<\/strong><\/h4>\n<p>Channel sources, often referred to as attribution, is a KPI that tells you where your customers are finding and installing your app. This vital information will help you develop your marketing campaign since it can distinguish between downloads from paid ads, organic mentions, or other combinations of the two.<\/p>\n<p>Which sources are the most successful? Which channels are you paying for, but not seeing results from? What keywords are driving the most traffic to your app page?<\/p>\n<p>Once you gather the data, you can adjust your marketing spend to focus on the channels that are driving the best results!<\/p>\n<h4><strong>f. Reviews and Ratings<\/strong><\/h4>\n<p>Reviews and ratings are a non-qualitative measure that can significantly affect the way users perceive your app. One of the first things someone will do when they arrive at your app page is to check out the reviews, so the more positive ratings, the better!<\/p>\n<p>Similarly, having many total reviews shows potential users that the people who have already downloaded the app feel passionately enough about how great it is to take the time to write a review.<\/p>\n<p>If you have negative reviews, take the time to respond to see what you could do better – and actually do it. Often, users will leave notes about features they care about most &#8211; so take advantage of this valuable feedback.<\/p>\n<p>Why else should you care about the ratings and reviews posted about your app? Well, both the Google and Apple app stores give preferential search rankings to those with higher ratings!<\/p>\n<p>Similarly, a study by <a href=\"https:\/\/go.apptentive.com\/Ratings-and-Reviews.html\">Apptentive<\/a> found that almost 60% of people will check reviews and app ratings before downloading anything. While this metric won&#8217;t tell you what is driving revenues or whether your marketing is effective, it will let you know if your users are happy with your app design.<\/p>\n<h3>Engagement Metrics<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13064\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/engagement-metrics-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/engagement-metrics-980x653.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/engagement-metrics-480x320.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>The next type of application KPIs are engagement metrics. These calculations will help you understand how users interact with your application, how many users you are retaining, and more.<\/p>\n<p>Engagement metrics are essential to track since they have a direct correlation to your bottom line!<\/p>\n<h4><strong>a. Retention Rate<\/strong><\/h4>\n<p>One of the most important KPIs relating to app development is your retention rate. Retention rate describes the number of users that return to your platform or continue to utilize it after time has passed.<\/p>\n<p>In other words, the higher your retention rate, the more positive implications of the performance of your app – including future revenue! The more people are using your app, the more valuable it is.<\/p>\n<p>Here’s how you can calculate it:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13058\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/retention-rate-1024x98.png\" alt=\"\" width=\"1024\" height=\"98\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/retention-rate-1024x98.png 1024w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/retention-rate-980x93.png 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/retention-rate-480x46.png 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>For example, consider that you have 10,000 total customers at the end of a specific month. You acquired 2,000 new users that month, and you had 9,500 users at the beginning of the month.<\/p>\n<p>To calculate the retention rate, you would take 10,000 and subtract 2,000, then divide it by 9,500. The result is a retention rate of 84%.<\/p>\n<p>So, what does this mean? Even though you added 2,000 new users in the month, you lost 500, so your retention rate is less than 100%.<\/p>\n<h4><strong>b. Number of Sessions<\/strong><\/h4>\n<p>The next KPI on our list is the number of sessions. This measurement refers to how many times specific individuals access your app, and it is an important indicator of &#8216;stickiness.&#8217; The stickier your app is, the less churn you will have because it means you are doing a great job of engaging your users.<\/p>\n<p>Think about it this way, the more often someone opens your app, the more engaged they are.<\/p>\n<p>In the world of app development, a session must be defined ahead of time. You must determine what will constitute a session – what interactions must a user have with your app in a given timeframe?<\/p>\n<p>Another way to calculate stickiness, besides counting the number of sessions per user, is to use the following formula:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13059\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/stickiness.png\" alt=\"\" width=\"476\" height=\"98\" \/><\/p>\n<p>As you can see with this formula, your users are more engaged if they log in every few days versus just once per month.<\/p>\n<h4><strong>c. Session Length<\/strong><\/h4>\n<p>Session length is how long a user spends on your app during each session. While longer session lengths are normally better, the answer to this depends on the goal of your application.<\/p>\n<p>For instance, you may design your app in a way that does not require users to stay on it long to complete the desired action. If this is the case, consider tracking the depth of sessions instead (see below).<\/p>\n<p>Similarly, make sure to view this metric concerning the number of crashes and uninstalls to determine if a correlation exists.<\/p>\n<h4><strong>d. Session Interval<\/strong><\/h4>\n<p>The amount of time that passes between a user’s sessions is known as the session interval.<\/p>\n<p>Are your users visiting the app daily or weekly? Do they log in several times per day?<\/p>\n<p>Shorter intervals generally indicate greater user engagement and opportunities to drive revenue. Again, this will also vary depending on the goals of your application. If your software pushes news headlines every 24 hours, then your session intervals should revolve around that instead.<\/p>\n<h4><strong>e. Session Depth<\/strong><\/h4>\n<p>Another session-related application metric is session depth. This is an important KPI that tells you how far along the user journey an individual gets before they exit the app.<\/p>\n<p>If someone logs into your application and makes a purchase, that session has greater depth than if they just signed in and browsed.<\/p>\n<p>Tracking this measurement will require analytics software that will provide you with insights into what users are doing once they log into your application.<\/p>\n<h4><strong>f. Exit Rate<\/strong><\/h4>\n<p>The exit rate is a KPI that gives you insights into what screens a user dropped-off from. It tells you what screen a user was viewing before they shut off the application or uninstalled it.<\/p>\n<p>This is an important metric because it lets you know what screens are not converting so that you can correct them. It is likely that the screen does not provide enough value or does not match your target audience&#8217;s expectation, but something is driving them away at that point in the user journey.<\/p>\n<p>Calculate the exit rate for each screen using this formula:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13060\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/exit-rate.png\" alt=\"\" width=\"588\" height=\"98\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/exit-rate.png 588w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/exit-rate-480x80.png 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) 588px, 100vw\" \/><\/p>\n<p>Let’s use an example to make this a bit more concrete. If your application requires users to navigate through five screens to complete the registration process, a percentage of users will likely drop off before completion.<\/p>\n<p>By calculating the exit rate, you can pinpoint the screens where the most users are dropping off and then take measures to improve it.<\/p>\n<h4><strong>g. Average Screens per Visit<\/strong><\/h4>\n<p>Let’s review another useful app metric, average screens per visit. This metric indicates how many unique pages a user sees during a visit to your application.<\/p>\n<p>For the most part, having a high average screen per visit is a good thing. When you rely on ads for monetizing your application this is especially true, since more screens can lead to more views.<\/p>\n<p>However, if users are going through many screens each visit but are still not making a purchase, it can be a sign that something needs to be changed or adjusted.<\/p>\n<h4><strong>h. Daily Active Users<\/strong><\/h4>\n<p>Daily active users, or DAU, refers to how many individuals log into your app every day. This figure alone will not indicate success or failure, but keeping track of it can help you calculate other KPIs.<\/p>\n<p>For example, if you average the number of daily active users in a month or year, you can use it to create a projection of future growth.<\/p>\n<h3><strong>i. Churn Rate<\/strong><\/h3>\n<p>Perhaps the most valuable engagement metric you need to track for your web or mobile application is churn rate. Churn rate is defined as the speed at which active users uninstall your app or unsubscribe from the program.<\/p>\n<p>It helps to think about this KPI as the opposite of your retention rate.<\/p>\n<p>The lower the churn rate, the better the app is performing. If users are uninstalling your applications at a rapid rate, it may indicate functionality problems or other serious issues. Other factors that can lead your users to leave are lack of new content or updates.<\/p>\n<p>So, how do you calculate the churn rate? You can use the following formula:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13061\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/churn-rate-1024x116.png\" alt=\"\" width=\"866\" height=\"98\" \/><\/p>\n<p>Data published by <a href=\"https:\/\/www.statista.com\/statistics\/384224\/monthly-app-launches-churn\/\">Statista<\/a> estimates that the average 3-month churn rate for mobile applications across the globe was 71%! This means that, on average, 71% of users drop off from using your platform every three months.<\/p>\n<p>Not only should you be on the lookout for high churn rates, but you should also be wary of a rising churn rate. It can be difficult to understand why users are leaving your application, but the faster you can determine the problem, the faster you can fix it!<\/p>\n<p>It can also help to calculate the churn rate for your customers that generate the most revenue since this is what truly drives your business.<\/p>\n<h3>Performance Metrics<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13063\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/performance-metrics-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/performance-metrics-980x653.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/performance-metrics-480x320.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>The next segment of KPIs is performance metrics. UX and performance KPIs can track your application’s technical performance. From an app development standpoint, these will drive your strategy and focus areas because they can indicate what issues are hurting the user’s experience.<\/p>\n<h4><strong>a. Load Time<\/strong><\/h4>\n<p>An essential performance metric your app design team should be following is load time. This KPI refers to how long it takes for the application to load from the initial startup request, plus the time it takes to transition from one screen to another.<\/p>\n<p>The faster the app, the better the user experience will be. Customers today are impatient, so you should always strive to make your load times as low as you can! Surveys have shown that the best apps will load in less than <a href=\"https:\/\/www.vmware.com\/products\/workspace-one\/intelligence-consumer-apps.html\">2 seconds<\/a>.<\/p>\n<h4><strong>b. Crashes<\/strong><\/h4>\n<p>One of the most frustrating things for users is when they download an app that continues to crash. This poor experience will likely drive your target audience away. That is why tracking crashes is essential to the success of your application.<\/p>\n<p>Mobile analytics solutions can provide you with information about how often the app is crashing, when it is occurring, and on what devices it is happening most frequently. This will drive churn rates and reduce customer retention, so you need to monitor this KPI closely.<\/p>\n<p>Your development team should be asking the following questions:<\/p>\n<ul>\n<li>How often does your application crash? Daily? Weekly?<\/li>\n<li>How many users are affected by these crashes?<\/li>\n<li>What were they doing when the application crashed?<\/li>\n<\/ul>\n<p>According to <a href=\"https:\/\/techcrunch.com\/2013\/03\/12\/users-have-low-tolerance-for-buggy-apps-only-16-will-try-a-failing-app-more-than-twice\/\">TechCrunch<\/a>, only 16% of users would be willing to keep trying an application if it fails more than twice – so you have a tiny margin of error here!<\/p>\n<h4><strong>c. Latency<\/strong><\/h4>\n<p>Application latency can be defined as the time it takes to get a response from the API once a user clicks on something within the program. Latency is closely tied to your load times, so you want this figure to be as low as possible.<\/p>\n<p>The best practice is to optimize your application to have a <a href=\"https:\/\/www.appdynamics.com\/media\/uploaded-files\/1432066155\/white-paper-16-metrics-every-mobile-team-should-monitor.pdf\">one-second response time<\/a>. Anything higher than this will increase your churn rates and cause users to abandon the application.<\/p>\n<h4><strong>d. Devices<\/strong><\/h4>\n<p>The next performance KPI to review is devices. This calculation is relatively straightforward since it involves gathering information about what devices your customers are using to access the application.<\/p>\n<p>You can generate comparisons between tablets and smartphones or Android versus iOS. Analyzing this KPI can help you enhance the performance of your app for each relevant device.<\/p>\n<h4><strong>e. Screen Resolutions<\/strong><\/h4>\n<p>Screen resolution relates to the types of devices your customers use to run your app. This metric provides you with information about which screen sizes you need to test for.<\/p>\n<p>App design and development teams should take this data into account when releasing updates or creating future versions of the application as well.<\/p>\n<h4><strong>f. Operating System<\/strong><\/h4>\n<p>Another application KPI that relates to performance is the operating system. While this is largely a question of how your app performs on iOS versus Android systems, a successful platform should work well on both.<\/p>\n<p>Take note if there is a higher crash rate or uninstall rate on one platform compared to another. You should also compare the ratings on each of the app stores to see why there might be a difference.<\/p>\n<h3>Revenue Metrics<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13065\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/revenue-metrics-1024x685.jpg\" alt=\"\" width=\"1024\" height=\"685\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/revenue-metrics-980x655.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/revenue-metrics-480x321.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>The last segment of KPIs you should review in app development and design is revenue metrics. This section is the most important area that you should be measuring since this will determine how you&#8217;re generating your revenue.<\/p>\n<p>These key performance indicators will take a look at what areas are generating the most money within the application, as well as how much you have to spend to acquire new users. You can also think about these as marketing metrics.<\/p>\n<h4><strong>a. Customer Acquisition Cost (CAC)<\/strong><\/h4>\n<p>Customer acquisition cost, or CAC, is a measure that tells you how much money you have to spend to obtain a new user. This calculation should include all marketing dollars spent to advertise your application. Don&#8217;t forget to include the time that it takes to develop those marketing campaigns as well!<\/p>\n<p>Calculate customer acquisition costs using this formula:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13066\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/customer-acquisition-cost.png\" alt=\"\" width=\"668\" height=\"98\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/customer-acquisition-cost.png 668w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/customer-acquisition-cost-480x70.png 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) 668px, 100vw\" \/><\/p>\n<p>Think of this metric as the average cost it took to get somebody to download the app.<\/p>\n<h4><strong>b . Customer Lifetime Value (CLTV)<\/strong><\/h4>\n<p>One of the most valuable revenue KPIs that app developers must monitor is customer lifetime value or CLTV.<\/p>\n<p>Customer lifetime value refers to how much profit a user will generate over the time they spend utilizing your application. It is important to note that this customer was not acquired for free, though, so you must take into account the acquisition cost as well.<\/p>\n<p>The higher the customer lifetime value, the better &#8211; since you&#8217;re able to acquire revenues above and beyond your initial marketing costs for every single user.<\/p>\n<p>Use this formula to calculate CLTV:<\/p>\n<p><strong>CLTV = (Annual Profit per User x Years They Remain a User) – Cost of User Acquisition<\/strong><\/p>\n<p>In general, the more successful the application, the higher the customer lifetime value. Your CLTV should also be higher than your customer acquisition costs &#8211; if it&#8217;s not, you have spent too much money on marketing, or there is not enough value for customers to make purchases in the application.<\/p>\n<p>Working to increase your customer lifetime value should be a goal for every app development team.<\/p>\n<h4><strong>c. Average Revenue per User (ARPU)<\/strong><\/h4>\n<p>The average revenue per user, often shortened to ARPU, is a KPI that measures how much value is generated per user within your application. The revenue generated can come from anything like clicks or ad impressions to pay downloads or subscriptions.<\/p>\n<p>Calculating this metric is relatively simple since you only need to divide the lifetime revenue of the application by the number of total users:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13067\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/arpu.png\" alt=\"\" width=\"412\" height=\"98\" \/><\/p>\n<p>For example, if your app has generated $1 million over its lifetime, and there have been $500,000 users, the average revenue per user is $2.<\/p>\n<p>As you can see, this metric provides essential information &#8211; using the example above, you can estimate that the average user will generate about $2 in revenue. ARPU is a useful metric for forecasting sales and determining how many users you need to onboard to meet your revenue targets.<\/p>\n<p>When measuring this KPI for your application, look for a rising average revenue per user as an indicator of success. If it appears that the ARPU is dropping, something is wrong, and you need to take corrective action to ensure that it does not decrease further.<\/p>\n<p>A variant of this metric is the average revenue per paying user, or ARPPU. It is essentially the same calculation, but this time you will exclude any customers who have never generated any revenues. They have not contributed anything towards your bottom line, So you can eliminate this segment and focus instead on paying users that are generating business.<\/p>\n<h4><strong>d. Time to First Purchase<\/strong><\/h4>\n<p>A unique performance metric to consider when developing the KPI&#8217;s for your application is time to first purchase. This KPI describes how long it takes for someone to complete a purchase within the application from when they downloaded the platform.<\/p>\n<p>Use the following formula to calculate it:<\/p>\n<p><strong>Time to First Purchase = Time of First Purchase – Time Registered as a User<\/strong><\/p>\n<p>Decreasing the time it takes for a customer to make their first purchase can only benefit you in the long run. This rule of thumb is especially true when you factor in other metrics like retention rates and customer churn &#8211; you want your users to make a purchase as soon as possible!<\/p>\n<h4><strong>e. Upgrades<\/strong><\/h4>\n<p>The next performance metric on our KPI list for web and mobile applications is the number of upgrades. This term refers to providing users with an option to upgrade to a premium or paid version of your application and tracking how long it takes for a registered user to take the upgrade.<\/p>\n<p>Another way to look at this is to consider what percentage of users stay on the free version compared to the percentage of users who make the upgrade purchase.<\/p>\n<p>If you have a greater percentage of users on the basic version, it could be that the premium option is not providing enough value to make them pay for it. It can also indicate lower engagement levels since they may not be ready to commit to buying the upgraded version.<\/p>\n<h4><strong>f. Return on Investment (ROI)<\/strong><\/h4>\n<p>The last app metric in this guide is perhaps the most well-known: return on investment. Return on investment, or ROI, demonstrates the value added to your company in terms of revenue compared to how much you spent on marketing and developing the application.<\/p>\n<p>This is a very difficult metric to calculate since getting reliable numbers to plug into the formula can be confusing and inconsistent. The first thing that you need to do is measure the total cost of your investment in the mobile application and identify the specific revenues that were generated as a result of this investment.<\/p>\n<p>You can use the following formula to determine ROI:<\/p>\n<p><img loading=\"lazy\" class=\"alignnone wp-image-13068\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/roi.png\" alt=\"\" width=\"718\" height=\"98\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/roi.png 718w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/02\/roi-480x66.png 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) 718px, 100vw\" \/><\/p>\n<p>Gathering the information to calculate the return on investment for a single mobile application can be difficult, especially if your company is working on more than one at a time.<\/p>\n<p>For instance, how do you decide what percentage of your annual design costs should apply to a single marketing campaign? Or how do you determine which marketing campaign converted a user and generated revenue?<\/p>\n<p>We recommend setting basic assumptions ahead of time so that you can calculate a value without spending too much time trying to isolate specific variables and results.<\/p>\n<p><strong>As you can see, there are many different KPI metrics for tracking web and mobile applications. Each one provides a distinct value to your organization. During app development, you must determine which ones will best measure the success of your application.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">Contact <a href=\"https:\/\/www.brightscout.com\/contact\">Brightscout<\/a> to help you design and build scalable high-performance web and mobile applications.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to app development, one of the most important things you must do is track KPIs. This ultimate guide will review everything you need to know about app metrics, such as what they are and which ones you should use to measure the success of your app.<\/p>\n","protected":false},"author":2,"featured_media":13055,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36,216,215],"tags":[],"yst_prominent_words":[87,297,800,230,106],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13054"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=13054"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13054\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media\/13055"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=13054"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=13054"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=13054"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=13054"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}