{"id":13172,"date":"2021-04-19T13:01:52","date_gmt":"2021-04-19T18:01:52","guid":{"rendered":"https:\/\/www.brightscout.com\/?p=13172"},"modified":"2021-04-19T13:01:52","modified_gmt":"2021-04-19T18:01:52","slug":"7-reasons-your-website-is-slow","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/7-reasons-your-website-is-slow\/","title":{"rendered":"7 Reasons Your Website is Slow"},"content":{"rendered":"<p>Everyone would rather have a fast-loading website than a slow-loading one. Although the loading time often depends on many factors, its impact on the website is massive. The page loading time is a crucial element in providing a great experience. How do you combat a slow website?<\/p>\n<p><!--more--><\/p>\n<p>A study published on <a href=\"https:\/\/www.quicksprout.com\/website-speed\/\" target=\"_blank\" rel=\"noopener\">Quick Sprout<\/a> reveals how website speed is vital to a business&#8217;s bottom line. A mere one-second delay in page load speed could result in:<\/p>\n<ul>\n<li>Up to 7% loss in conversions. This means that a business loses a significant portion of its potential income for every second the website loads slowly.<\/li>\n<li>As many as 11% fewer page views. People have little patience with slow internet and slow websites. Failing to fix a slow-loading website means fewer people get to know about your brand.<\/li>\n<li>As many as 16% of your website visitors will feel less satisfied with a slow website, and may not come back.<\/li>\n<\/ul>\n<p>To put these figures in perspective, estimates show that <a href=\"https:\/\/medium.com\/@vikigreen\/impact-of-slow-page-load-time-on-website-performance-40d5c9ce568a\" target=\"_blank\" rel=\"noopener\">Amazon would lose as much as 1.6 billion<\/a> in sales every year if one page of their website had a one-second lag.<\/p>\n<p>Think of a site loading speed as a sliding scale. The faster the site is, the more benefits it reaps. If your website loads slowly, you have no idea how much money your business could be losing every day.<\/p>\n<h2><strong>What is a Normal Page Load Speed?<\/strong><\/h2>\n<p>An average page load speed is two seconds, according to <a href=\"https:\/\/gtmetrix.com\/\">Gtmetrix<\/a>, <a href=\"https:\/\/tools.pingdom.com\/\">Pingdom<\/a>, and <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\">Google PageSpeed Insights<\/a>. According <span class=\"spelling\">to Currati<\/span>.com, as many as <a href=\"https:\/\/curatti.com\/web-design-usability\/\">half of the users expect to wait for a maximum of 2 seconds for a web page to load<\/a>. The absolute worst time your page should take to load is 3 seconds. Any number higher than this means there is a good chance too high a number of your potential visitors will be abandoning the site before it completes loading.<\/p>\n<p>Despite this expectation the users have on website load times, the same page may load at different speeds in different places. Even website speed load measuring tools such as Pingdom and GT Metrics may sometimes report different page load speeds for the same web pages. Here are seven reasons your website may load slowly, and fixes you can apply to remedy it.<\/p>\n<h3><strong>1. Poor Server Performance<\/strong><\/h3>\n<p>Since a website loads from the ground up, the server must act fast when a user browser pings it and asks for information. If your website is hosted with a server with poor performance, it will take longer than necessary to respond to the user request. No matter how fast everything else is, if the server is slow, the website will always be slow.<\/p>\n<p>You can always narrow down server performance problems to your web host. A cheap web host means that resources are shared, and performance depends on traffic and other factors. To avoid having to queue users, consider a high-performance hosting service.<\/p>\n<h3><strong>2. Large Uncompressed Images<\/strong><\/h3>\n<p>When a user pings your website server, it will prompt it to send all the requested bits of the website to the browser for proper rendering and display. The server will always provide all content, including text and images. Large items, such as raw and multi-frame images, will take longer to bring out, slowing down website response.<\/p>\n<p>You must optimize images on your website for the slowest connections and smallest devices. The choice of image formats may play a role here. For instance, PNG, JPG, and GIF images perform a lot better when compressed than BMP and TIFF images.<\/p>\n<h3><strong>3. Too Many RTTs (Server File Requests)<\/strong><\/h3>\n<p>We have already established that large multimedia website items will cost more time to load. That is not all. The number of items the server sends over when the browser makes a request also affects the page loading speed.<\/p>\n<p>Every JavaScript script, CSS file, image, icon, and button on the website will take a little more time to load. The mistake most people make is assuming all is fine as long as the number of page items does not exceed the maximum number of requests that can be made to the server per second. It is good to save resources and space, especially when structuring the website to be hosted remotely. The fewer the number of objects the server has to send over to the browser, the faster the website will load.<\/p>\n<h3><strong>4. JavaScript Render Delays<\/strong><\/h3>\n<p>JavaScript is a must-have code that makes almost every website functional and friendly to visitors. Without JavaScript, browsing the internet would be dull and non-interactive. However, despite how useful it is, JavaScript can cause delays in page loading when published unoptimized.<\/p>\n<p>This mostly happens when a significant JavaScript functionality must fully load its JavaScript files before the page completes to load other elements. This often causes the page to briefly freeze as JavaScript files are transferred and loaded.<\/p>\n<p>There are three solutions to this problem:<\/p>\n<ol>\n<li>Remove external JavaScript files and use inline JavaScript code instead.<\/li>\n<li>You can use asynchronous loading on your website so that JavaScript loads its files separately from the website.<\/li>\n<li>Your developer can defer the loading of JavaScript functions until the entire web page is loaded on the browser.<\/li>\n<\/ol>\n<h3><strong>5. Poorly Optimized CSS<\/strong><\/h3>\n<p>Like JavaScript, your website needs to have CSS to be able to display on browsers. However, the code responsible for styling the pages can cause massive delays in page load speed if it is not optimized correctly. A streamlined CSS code will make the page load faster and display better on the browser.<\/p>\n<p>There are three solutions to fixing slow load times caused by CSS code. The most practical is to use an external CSS file, often a combination of multiple CSS files fitted into a few lines of code. The more popular solution is to simply use inline CSS code instead. If your CSS code encounters errors, you may need to specify its media types when the problematic CSS files are loaded.<\/p>\n<p>Using agile design in your website&#8217;s development can go a long way to prevent problems that result from poorly optimized JavaScript and CSS code. The design methodology focuses on delivering stable and consistent websites with minimal inconsistencies broadly categorized as unoptimized elements of a web page.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13174\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/website-1024x683.jpg\" alt=\"person on phone\" width=\"1024\" height=\"683\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/website-1024x683.jpg 1024w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/website-980x653.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/website-480x320.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<h3><strong>6. You Do Not Use a Content Delivery Network (CDN)<\/strong><\/h3>\n<p>The way long-distance calls used to take longer to connect in the age of the wire telephone, is the same principle that causes websites hosted in another continent to load slower than those hosted closer to the user.<\/p>\n<p>If your website is only slow for users in a specific geographic location, there is a good chance the server location could be the culprit. You cannot have a server in every continent or country you expect to receive visitors, but you can use a Content Delivery Network to achieve the same result.<\/p>\n<p>Content Delivery Networks are servers strategically placed in different geographic locations to store copies of web pages and make them faster for users to load. A good example of a successful CND platform is <a href=\"https:\/\/www.cloudflare.com\/lp\/content-delivery-network\/\" target=\"_blank\" rel=\"noopener\">Cloudflare<\/a>.<\/p>\n<h3><strong>7. Too Much Overhead in Your Website Database<\/strong><\/h3>\n<p>The term &#8220;overhead&#8221; refers to any extraneous items stored in your website&#8217;s database. Items such as transients, logs, and other installed items such as plugins and themes, can build up over time. Before you realize it, they cost your website a second or more in page loading time because it takes longer to read the database. In some cases, unused items in the website database are the leading cause of overhead queries that results in web server timeout problems.<\/p>\n<p>It is imperative your website database is lean and optimized for performance. Today, most hosts will allow you to access the admin dashboard of your website on the hosting account to run optimization scripts and manually inspect the database.<\/p>\n<h2><strong>How to Troubleshoot a Slow Loading Website<\/strong><\/h2>\n<p>The quality of service offered by your web hosting provider has the greatest impact on your website&#8217;s performance. Depending on the nature of your hosting provider, the first place you should diagnose when experiencing slow loading times is the host. However, that said, the host may not be wholly responsible for slow loading speeds that cost your business exposure, visitors, customers, and ultimately, sales.<\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-large wp-image-13175\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/google-page-speed-1024x582.png\" alt=\"\" width=\"1024\" height=\"582\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/google-page-speed-980x557.png 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/04\/google-page-speed-480x273.png 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><\/p>\n<p>To fully analyze your website and find any performance bottlenecks, you can <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\" target=\"_blank\" rel=\"noopener\">Google&#8217;s PageSpeed Insights<\/a>. This is a handy tool that will quickly evaluate speed issues on both desktop browsers and mobile devices. Then, it provides suggestions on how to remedy the problem.<\/p>\n<h2><strong>Conclusion<\/strong><\/h2>\n<p>The design principles by which your website was designed and developed also affect its performance and load speed. Agile software development principles can minimize these top causes of slow loading websites. If you would like to know how this would help your website&#8217;s performance, <a href=\"http:\/\/brightscout.com\/contact\" target=\"_blank\" rel=\"noopener\">contact Brightscout<\/a> for professional advice today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Everyone would rather have a fast-loading website than a slow-loading one. Although the loading time often depends on many factors, its impact on the website is massive. The page loading time is a crucial element in providing a great experience. How do you combat a slow website?<\/p>\n","protected":false},"author":3,"featured_media":13173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[215],"tags":[961,960],"yst_prominent_words":[376,742,630,417],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13172"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=13172"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13172\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media\/13173"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=13172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=13172"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=13172"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=13172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}