{"id":13276,"date":"2021-08-23T13:27:20","date_gmt":"2021-08-23T18:27:20","guid":{"rendered":"https:\/\/www.brightscout.com\/?p=13276"},"modified":"2021-10-20T10:49:30","modified_gmt":"2021-10-20T15:49:30","slug":"jamstack-vs-out-of-the-box-do-you-need-to-make-a-change","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/jamstack-vs-out-of-the-box-do-you-need-to-make-a-change\/","title":{"rendered":"Jamstack Vs. Out-of-the-Box – Do You Need to Make a Change?"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Are you curious or even on the fence about switching to Jamstack? That&#8217;s understandable. After all, the looming changes in web design could provide a <a href=\"https:\/\/www.brightscout.com\/services\/jamstack\/\">sustainable competitive advantage for your business.<\/a> <\/span><\/p>\n<p><!--more--><\/p>\n<p><span style=\"font-weight: 400;\">Many platforms that provide the infrastructure and technology to support modern websites are comprehensive and monolithic. But while they provide just about everything you need to create your website, they are restrictive and somewhat closed.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">(Or so the Jamstack supporters imply.) <\/span><\/p>\n<p><span style=\"font-weight: 400;\">So should you make the switch to Jamstack?<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We understand the last thing you want is to fall prey to the shiny new object syndrome. So while we have an inherent bias towards Jamstack web design, we acknowledge that it&#8217;s not for everyone. As such, we&#8217;re providing an honest evaluation of the benefits and limitations of Jamstack in relation to out-of-the-box web design platforms – to help you make the best decision for your organization. <\/span><\/p>\n<h2><b>Jamstack vs. Out-of-the-Box: Not an Apples-to-Apples Comparison<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Jamstack is a technology stack, while out-of-the-box solutions are software platforms. So the two may serve a similar purpose –web design – but their approach and techniques are different. To ensure we&#8217;re on the same page, here&#8217;s a quick overview of the two infrastructures.  <\/span><\/p>\n<h2><b>Jamstack Overview <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Jamstack is a technology stack comprising JavaScript, APIs (application programming interfaces), and Markup. In this case, Markup is an HTML that&#8217;s &#8220;teleported&#8221; through a static content generator. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The term is applied to ecosystems emerging around its core technologies, including an API economy, headless content delivery networks (CDNs), and edge computing technologies.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">As Matt Billmann explains: <\/span><\/p>\n<p><i><span style=\"font-weight: 400;\"> &#8220;Traditional monolithic systems like WordPress, Rails, Drupal, and so on — they always had the plugin system inside. You would have WordPress plugins inside WordPress. That was a limiting factor; everything had to fit into that model-like, &#8216;We have this box, and we have these things inside it.&#8217; And now, that whole extension system has moved to different APIs and services [outside of the box], which is more powerful in so many ways.&#8221;<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">In short, Jamstack liberates and frees the APIs that power plugins and other extensions for website platforms. That results in more freedom and flexibility for developers and businesses. However, the solution is somewhat disorderly, and non-techies can find it user-unfriendly.  <\/span><\/p>\n<p><b>Jamstack in a nutshell<\/b><span style=\"font-weight: 400;\">: <\/span><a href=\"https:\/\/us.louisvuitton.com\/\"><span style=\"font-weight: 400;\">Louis Vuitton<\/span><\/a><span style=\"font-weight: 400;\"> e-commerce site <\/span><\/p>\n<p><b>Frontend\/generator:<\/b><span style=\"font-weight: 400;\"> VueJS<\/span><\/p>\n<p><b>CDN:<\/b><span style=\"font-weight: 400;\"> Akamai <\/span><\/p>\n<p><b>Results<\/b><span style=\"font-weight: 400;\">: high performance, easy &amp; quick checkout process, no technology glitches<\/span><\/p>\n<p><span style=\"font-weight: 400;\">(Overall, the site makes it clear that static designs lack a sense of dynamism.)<\/span><\/p>\n<h2><b>Out-of-the-Box Platforms Overview <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Out-of-the-box web design platforms are an all-in-one solution for building your applications. As the name suggests, they work immediately with or without &#8220;special&#8221; installation, configuration, and modification. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">At their heart is a CMS (content management software) with a commendable ecosystem of plugins. For example, if you want to add a new payment provider to your site, you only need to add a relevant plugin. That explains why they&#8217;re popular. Anyone can create a website even without any coding skills. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">(<\/span><i><span style=\"font-weight: 400;\">In Jamstack, you&#8217;ll have to find the payment provider, integrate and test it. You&#8217;ll also require a process to deploy new sites or update pages.)<\/span><\/i><\/p>\n<p><span style=\"font-weight: 400;\">By design, out-of-the-box platforms are comprehensive and monolithic. They need a LAMP stack to run. However, they face speed, security, and other limitations inherent to monolithic web design infrastructure.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The main difference between the two web design solutions is flexibility and adaptability. Jamstack is more flexible, while monolithic infrastructure limits your site&#8217;s chance for innovation and improvement. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">With that in mind, let&#8217;s explore the benefits Jamstack has to offer. And any limitations thereof.<\/span><\/p>\n<div id=\"attachment_13278\" style=\"width: 1034px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-13278\" loading=\"lazy\" class=\"size-large wp-image-13278\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/08\/Woman-Using-Her-Computer-for-Work-1024x683.jpg\" alt=\"\" width=\"1024\" height=\"683\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/08\/Woman-Using-Her-Computer-for-Work-1024x683.jpg 1024w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/08\/Woman-Using-Her-Computer-for-Work-980x654.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/08\/Woman-Using-Her-Computer-for-Work-480x320.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) 1024px, 100vw\" \/><p id=\"caption-attachment-13278\" class=\"wp-caption-text\">Shot of a young woman using a computer while working from home<\/p><\/div>\n<h2><b>Pros of Jamstack Over Out-of-the-Box Web Design <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Jamstack outdoes traditional web design platforms in many aspects. Below are some of its benefits – a hint that Jamstack could be the future of web design. <\/span><\/p>\n<h3><b>High Security<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">While no computer system is 100% secure, attacking a static site is relatively hard. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Typical cyber-attacks require the server to run the malware code. That&#8217;s why out-of-the-box platforms are highly vulnerable. In Jamstack, however, the server is a CDN which minimizes the surface area of attack. Even if a hacker overloads a CDN, that&#8217;s just one node in a distributed global network. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Still, taking down the whole CDN is no easy feat. And if it happens, you can easily upload the static file to a different CDN and change the domain name system (DNS.) <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Besides a CDN, a Jamstack system uses multiple APIs and server-less solutions. But while APIs can be compromised, it&#8217;s not on you to do the heavy lifting. Yours is to keep your private key secure and leave the rest to the provider. Plus, if one of the APIs gets hacked, it does not compromise other APIs in the system.  <\/span><\/p>\n<p><span style=\"font-weight: 400;\">While serverless functions can be hacked, they only run for up to 10 seconds. Thus, taking over one solution is not as attractive as hacking an actual server. (Traditional web design platforms run a server-side logic, which makes them attractive to hackers. After all, there&#8217;s a CPU to hack, and the database contains lots of information.)<\/span><\/p>\n<h3><b>Better Scalability <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">While scaling is a non-issue for small sites, it&#8217;s a serious consideration for sites generating tons of traffic. And for sites created using traditional design platforms, scaling is an expensive and uphill battle. After all, traditional solutions handle heavy traffic loads by caching popular views and resources. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Jamstack steps in to rectify that. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When content is served from a CDN, there&#8217;s no complex workflow or logic to determine what and when to cache site assets. With Jamstack, anything is cacheable in a CDN.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Serverless functions enable easy scalability too. When you add or change functionalities, you can work in reusable APIs to minimize work and computing power. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Better still, the scaling takes place outside your design infrastructure. So no downtime or additional server expenses. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Being pre-generated, Jamstack sites can also be hosted from different services, making scalability even easier.  <\/span><\/p>\n<h3><b>Better Performance<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">While you can make your WordPress site fast, it&#8217;s no guarantee that it will load faster. Yes, you can: reduce plugins, use lightweight themes, or use a better host; but a fast loading speed remains far from given. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">(After all, traditional platforms have complexities that require effort to optimize.)<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Jamstack, on its end, is pre-optimized and easy to improve. It generates pages way ahead of time – during the <\/span><b>build<\/b><span style=\"font-weight: 400;\">. (Eliminating the need to produce page views at request time.) <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The pages are loaded on a content delivery network. And seeing that CDN can be located anywhere across the world, the server is closer to the user\/surfer. The result is few to no lags, no slowdowns, and faster loading times. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The high performance is a boost for both SEO and user experience. According to <\/span><a href=\"https:\/\/support.google.com\/webmasters\/answer\/9205520?hl=en\"><span style=\"font-weight: 400;\">Google<\/span><\/a><span style=\"font-weight: 400;\">, if load time increases from one to three seconds, the bounce rate hikes by 32%. If load speed increases to six seconds, the bounce rate will increase by 106%. 53% of mobile users bounce off a site taking over 3 seconds to load. Amazon reported equally dramatic observations: every 100ms latency cost Amazon 1% in sales.<\/span><\/p>\n<h3><b>Easier Maintainability<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Jamstack reduces the complexity revolving around hosting websites, which, in turn, reduces the maintenance activities. (A pre-generated website served from a CDN does not need a team of developers to keep it functional. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Seeing that most work is done in the build pages, the resulting site is stable. The server-less functionality further minimizes maintenance tasks by eliminating the need for continued patching and updating. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Furthermore, you operate within the infrastructure, making it easier to keep it up and running – without the need for add-ons and additional tools.<\/span><\/p>\n<h3><b>Enhanced Developer Experience<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Jamstack decouples the backend and front end frameworks. As such, the sites can be built with different tools – as per the developer&#8217;s preferences. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Seeing that Jamstack sites build on widely available conventions and tools, it&#8217;s easy to find skilled and talented developers to help you out.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Overall, Jamstack developers benefit from: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Reusable APIs: help deploy new sites or features without the need to create new APIs from scratch.  <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Front end decoupled from backend: eliminates the need to dig into the code to make modifications. That way, your business can respond to changes quickly. <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">A ripe environment for Agile designs: your DevOps team can transition between different tools, test, and implement new ideas for more effectiveness and efficiency.   <\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">The enhanced developer experience translates to better customer experience and satisfaction. <\/span><\/p>\n<h3><b>Lower Costs<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Jamstack reduces the expenses spent on servers, databases, and maintenance. Development teams use third-party apps and APIs to manage DevOps – no need to spend more on additional apps. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Generally, whether you&#8217;re serving a million requests every month, hosting static files is cheaper than running PHP 24\/7. With the latter, the more the traffic load, the higher the costs. With Jamstack, you only pay for what you use. <\/span><\/p>\n<h2><b>Cons of Jamstack Web Design Over Out-of-the-Box Platforms <\/b><\/h2>\n<p><span style=\"font-weight: 400;\">However great Jamstack is, it&#8217;s limited in some aspects. These limitations may be &#8220;smallish&#8221; imperfections or bigger obstacles, depending on your web requirements. That&#8217;s why it&#8217;s good to consider the good and the bad. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">The bad:   <\/span><\/p>\n<h3><b>Beginner Unfriendly <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">You don&#8217;t need to be tech-savvy to create a website on traditional platforms. Conversely, you must have some coding skills to use Jamstack. For a beginner, that means learning coding skills or hiring developers proficient in Jamstack technology. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Furthermore, using Jamstack to build websites with many pages can get complex as the static site generator must render each page before it&#8217;s deployed. <\/span><\/p>\n<h3><b>Poor Plugin Ecosystem <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">While Jamstack frees the APIs that power plugins and website extensions, it has a poor plugin ecosystem. It, therefore, requires a process to deploy new sites, features, and updates. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">For example, if you want to add a new payment provider, you&#8217;ll have to find the provider, integrate the payment method, and test it. All of which can be a hassle, especially if you lack coding skills.<\/span><\/p>\n<h3><b>Not Ideal for Real-time Updates  <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Jamstack is not for you if looking for a site whose content updates in real-time. Think of Facebook or LinkedIn. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Moreover, any dynamic features require more heavy lifting from your end. There&#8217;s no database to process dynamic requests; thus, you&#8217;ll need to process such requests with your code and APIs. That means you need more resources as dynamic features are not a part of the Jamstack infrastructure. <\/span><\/p>\n<h2><b>Is Jamstack Suitable for Your Business?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">With the pros and cons down, you probably have a pretty picture of whether Jamstack is the right solution for your business. If not, here&#8217;s a quick summary. <\/span><\/p>\n<h3><b>Pros<\/b><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Better user experience <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Great for SEO<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Better and easier scalability <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Fast time-to-market <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Easy Headless CMS integration <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Flexible UX and UI building  <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Relatively cheap to maintain and host <\/span><\/li>\n<\/ul>\n<h3><b>Cons <\/b><\/h3>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">May require development to make changes <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Generating previews takes time<\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Not dynamic friendly <\/span><\/li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Poor plugin ecosystem <\/span><\/li>\n<\/ul>\n<h2><b>I Don&#8217;t Want to Miss Out on All the Goodies Jamstack has to Offer. Can BrightScout Help?<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">While Jamstack provides higher security, faster load speeds, and lower maintenance costs, it does take some effort to get up and running properly.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Hosting takes a little more configuration to get right, and you must put some thought into how to best integrate a headless CMS. You also need to re-generate the website manually. And work on the best practices concerning site architecture and optimization. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Fortunately, BrightScout exists to help you make the most out of your customers&#8217; needs. Our goal is to deliver purposefully beautiful designs. So you can rely on us if you want to leverage all Jamstack has to offer – or better yet – the best of both worlds. <\/span><a href=\"http:\/\/brightscout.com\/contact\"><span style=\"font-weight: 400;\">To learn more<\/span><\/a><span style=\"font-weight: 400;\"> about how we can help, <\/span><a href=\"https:\/\/www.brightscout.com\/services\/jamstack\/\"><span style=\"font-weight: 400;\">click here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are you curious or even on the fence about switching to Jamstack? That&#8217;s understandable. After all, the looming changes in web design could provide a sustainable competitive advantage for your business. <\/p>\n","protected":false},"author":3,"featured_media":13277,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[215],"tags":[],"yst_prominent_words":[72,372,657],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13276"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=13276"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13276\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media\/13277"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=13276"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=13276"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=13276"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=13276"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}