{"id":13612,"date":"2021-11-09T15:09:34","date_gmt":"2021-11-09T21:09:34","guid":{"rendered":"https:\/\/www.brightscout.com\/?p=13612"},"modified":"2021-11-09T15:10:54","modified_gmt":"2021-11-09T21:10:54","slug":"creative-brief-top-10-questions","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/creative-brief-top-10-questions\/","title":{"rendered":"Top 10 Questions You Need on Your Creative Brief"},"content":{"rendered":"<p>We have all been there. The project is stuck, the budget is overblown, the deadlines swoosh by, but the scope of the project keeps changing. Everyone of importance to the project is on a different page, messing up design and development. These are the most severe signs that you did not set a proper foundation for the project before it began. Chances are, the biggest culprit is a bad or poorly filled project brief. The most effective projects begin with a solid and effective brief that outlines the problem and the steps to find the solution. The responsibility to create a creative brief falls on the design and development firm &#8211; there are no two ways about it.<\/p>\n<p>An effective brief is essentially detailed ingredients to complete the project creatively, within scope, on time, and within budget. However, the client is a big part of establishing the foundation for such success.<\/p>\n<p>The problem with most creative briefs in use today is not their content; it is the tone and presentation. Clients find the process of filling them out cumbersome and uninspiring. If you want your project to start right, you must create a brief that the clients will be enthusiastic to fill out and not feel like torture.<\/p>\n<p>This brief post will show you what makes the best creative brief and how you can create one that your clients will actually enjoy filling out.<\/p>\n<h2><strong>Outline of the Ideal Creative Brief<\/strong><\/h2>\n<p>The ideal brief should provide all the information required to guide the team&#8217;s focus on what is most important. The brief must contain these ten sections:<\/p>\n<ol>\n<li>Project title<\/li>\n<li>Business overview<\/li>\n<li>Project background<\/li>\n<li>Objectives<\/li>\n<li>Target audience<\/li>\n<li>Challenge<\/li>\n<li>Mandatory information<\/li>\n<li>Deliverables<\/li>\n<li>Timeline<\/li>\n<li>Team members<\/li>\n<\/ol>\n<p>As much as it is a standard document, a creative brief needs to be simple, compelling, and concise enough to wrap all the critical project details in a page or two.<\/p>\n<h2><strong>What Are the Best Practices for Crafting a Winning Creative Brief?<\/strong><\/h2>\n<p>The best practices of creating a winning creative brief are pretty much the same you are already familiar with. Here are the most important you need to remember:<\/p>\n<h3><strong><em>1. Aligns the team with client and stakeholders<\/em><\/strong><\/h3>\n<p>Before the project starts, it pays off to bring everyone involved in the project together in one place in an initial meeting. The problems most projects face are often due to miscommunication, particularly the mismatch between the planning and the execution phases.<\/p>\n<p>The core objective of this meeting is to align all the project details before execution begins. It also helps to clear up any confusion before the team invests time and effort in the process.<\/p>\n<h3><strong><em>2. Elevates simplicity above all else<\/em><\/strong><\/h3>\n<p>Complexity may, at times, look classy &#8211; but it is expensive in many ways. Therefore, when creating a project brief, focus on condensing down complex things into their simplest form. Simplicity minimizes the chances of misunderstandings.<\/p>\n<p>As a rule of thumb, your project brief should not contain any extraneous information. It should only have, and ask for, the information the team needs to understand the task at hand and inspire ideas on how to solve them.<\/p>\n<h3><strong><em>3. Honest and plain language<\/em><\/strong><\/h3>\n<p>Many ineffective briefs have one thing in common: they shy away from any uncomplimentary truths that may make the client and project seem bad. Of course, no one wants to hurt the client&#8217;s feelings &#8211; especially right after a project deal is inked; but then, these truths, told in simple and plain language, steer the project.<\/p>\n<p>There should be no marketing strategies or overly diplomatic language in a creative brief. The more honest the brief, the better the solutions the team will create.<\/p>\n<h3><strong><em>4. Tell a story to the target audience<\/em><\/strong><\/h3>\n<p>Who are you trying to reach? What is it they care about? What are their worries and what excites them the most?<\/p>\n<p>When working on a client project, your team essentially becomes the client for the project&#8217;s duration. Write a brief in the perspective of the client, telling a story to their target audience.<\/p>\n<p>Since the brief sets the tone for the entire project, it is critical that you set it right. Try to get the team and the clients excited for the opportunity to create something impactful. It is tempting to create a brief that lists down facts and deliverables with no personality, but how effective would it be? People love stories, and the brief can use various media to reach this end.<\/p>\n<h3><strong><em>5. Converse with company cultures<\/em><\/strong><\/h3>\n<p>Everyone &#8211; from the project team and the client to their target audience, wants to be a part of something greater than themselves. This is an innate instinct everyone has. The best creative brief leverages this and seeks to align with cultural matters that are greater than themselves. A good example is Tesla&#8217;s culture and tone in their projects to get their teams and audience alike excited about their products.<\/p>\n<h2><strong>10 Steps of Creating the Best Creative Brief<\/strong><\/h2>\n<p>The ideal creative brief is a document that creates and cements a partnership between the client and the team for the duration of the project. In addition, it must inform and guide the process in a simple yet practical approach. Here are the ten steps you should follow when creating a winning creative brief that clients will have an easy time filling out.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-13614\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/11\/creative-brief-planning.jpg\" alt=\"creative-brief-planning-with-papernote-writing-strategy-on-glass-wall-in-office\" width=\"1322\" height=\"793\" srcset=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/11\/creative-brief-planning.jpg 1322w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/11\/creative-brief-planning-1280x768.jpg 1280w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/11\/creative-brief-planning-980x588.jpg 980w, https:\/\/www.brightscout.com\/wp-content\/uploads\/2021\/11\/creative-brief-planning-480x288.jpg 480w\" sizes=\"(min-width: 0px) and (max-width: 480px) 480px, (min-width: 481px) and (max-width: 980px) 980px, (min-width: 981px) and (max-width: 1280px) 1280px, (min-width: 1281px) 1322px, 100vw\" \/><\/p>\n<h3><strong><em>Step 1: Come Up with a Project Name or Campaign Title<\/em><\/strong><\/h3>\n<p>The first step in running a successful project is to give it a moniker &#8211; something that both the team and the client, and their stakeholders can recognize at a glance. Naming the project is one of the most mission-critical yet overlooked components of a creative brief.<\/p>\n<p>The project name, or campaign title, needs to be brief and creative. A few words in a sentence that describe the project may be enough. Most clients may want you to seek their input when giving the project a name.<\/p>\n<h3><strong><em>Step 2: The Business Overview Section<\/em><\/strong><\/h3>\n<p>Information about the brand is an essential part of a great creative brief. The team, new hires, freelancers, vendors, and even management of the company will find the overview about the client&#8217;s business invaluable to figuring them out.<\/p>\n<p>The business overview section should not be a long &#8216;about us&#8217; history of the business; tailor the business overview section to the project at hand. This means the information the part requests should revolve around the brand&#8217;s mission and the challenge at hand.<\/p>\n<h3><strong><em>Step 3: Establish the Project Background<\/em><\/strong><\/h3>\n<p>The creative brief begins to get more specific in this step. Here, it should go deeper to explain the purpose of the project, its timeline, and the audience it targets. While it is acceptable to have this section longer, perhaps a few stylized sections, it is best to surmise it into two or three sentences.<\/p>\n<p>Some clients may not identify any clear challenges that the team needs to solve. In such a case, the team should scrutinize the project background and use its problem-solving skills and experience to fill in the gaps.<\/p>\n<h3><strong><em>Step 4: Set the Project Objectives<\/em><\/strong><\/h3>\n<p>Even the best team in the world would not be able to meet a client&#8217;s goal if they do not understand them. Therefore, setting the objectives of the project is key to setting the goals and working backward to make the solutions work.<\/p>\n<p>This section explicitly details the client&#8217;s expectations at the end of the project. Since project objectives tend to change fast, this is the only section where you can encourage the client to use dynamic and accommodating language.<\/p>\n<h3><strong><em>Step 5: Know Target Audience<\/em><\/strong><\/h3>\n<p>The target audience is the segment of the market for which the project product should benefit directly. The brief should describe the target audience using demographics, user behaviors, psychographics, and even geographic features. It should elaborate on what the target audience thinks, how they think and feel, and what problems they face.<\/p>\n<p>The brief must define a target audience in this section. Some products may have a primary and secondary target audience. This section should describe them in detail to give the team more freedom to explore creative ideas that will resonate with them all.<\/p>\n<h3><strong><em>Step 6: Define The Project Challenge<\/em><\/strong><\/h3>\n<p>Why is the project necessary now?<\/p>\n<p>The project&#8217;s &#8216;why&#8217; is an excellent opportunity for the team to steer the project in the direction the client wants but may not clearly articulate it. This step is all about summarizing the conflicts and emotions of the challenge into a clear statement.<\/p>\n<p>Understanding the challenges that motivated the client to partner with your company is key to building solutions that will provide effective solutions. Defining the project&#8217;s &#8216;why&#8217; will also go a long way to shape how the project is run, what solutions the team comes up with, and how the project output is implemented.<\/p>\n<h3><strong><em>Step 7: Request Project Mandatories<\/em><\/strong><\/h3>\n<p>There is always something unique that makes a brand or product stand out. It can be a simple idea or a company secret, or anything in between. If there is anything that the client wishes to share about the project or business that the team does not know but needs to, it should go here.<\/p>\n<h3><strong><em>Step 8 Outline Project Deliverables<\/em><\/strong><\/h3>\n<p>What does the client expect to receive at the end of the project? Project deliverables or key performance indicators (KPI) are the metrics of project success. What does the client expect to receive at the end of the project?<\/p>\n<p>Everyone in the team should understand what and how the deliverables will be assessed and evaluated. The project brief should encourage the client to take the time and identify the most important deliverables based on project parameters and specs.<\/p>\n<h3><strong><em>Step 9 Breakdown the Timeline<\/em><\/strong><\/h3>\n<p>The timelines for the project, including deadlines for milestones and deliverables, should be realistic. The brief should break down and distribute tasks and milestones based on timelines agreed upon with the client. Be sure to include the dates for approvals and revisions for each deliverable and encourage the client to be realistic about feedback and signoff times.<\/p>\n<h3><strong><em>Step 10: Introduce the Team<\/em><\/strong><\/h3>\n<p>Who else is involved in the project?<\/p>\n<p>Creative, design, marketing, and development teams are essential to the execution of the project, but who else matters? Perhaps the client has other teams such as social marketing teams, sales, or IT teams that need to be a part of the project. In addition, other internal teams, including service vendors, third-party agencies, client partners, and brand owners, may be included in this list.<\/p>\n<p>While not everyone may be directly involved in the project, it is important that stakeholders and key contributors get to know each other at the appropriate time. The brief should include the names and contacts of all teams that matter.<\/p>\n<h2><strong>Conclusion: Bring it All Together<\/strong><\/h2>\n<p>These steps, requirements, and rules may seem a bit much for a creative brief, especially since it must be condensed into a page or two long. However, they are what it takes to create a winning creative brief with skill.<\/p>\n<p>You can choose the long way around and create a brief from scratch, or you can save time and use one already designed for you. <a href=\"https:\/\/drive.google.com\/file\/d\/15SmyAgtWrOCrMt2_HEqWftzoyIaYzpKT\/view?usp=sharing\">Click here<\/a> to download Brightscout&#8217;s ready-made creative brief that your clients will actually want to fill out. Looking for more in-depth help? Fill out our <a href=\"http:\/\/brightscout.com\/contact\">contact form<\/a> and we will reach out!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have all been there. The project is stuck, the budget is overblown, the deadlines swoosh by, but the scope of the project keeps changing. Everyone of importance to the project is on a different page, messing up design and development. These are the most severe signs that you did not set a proper foundation [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":13613,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[1],"tags":[],"yst_prominent_words":[888,419,280,56],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13612"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=13612"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/13612\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media\/13613"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=13612"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=13612"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=13612"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=13612"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}