{"id":141,"date":"2018-02-05T09:01:11","date_gmt":"2018-02-05T15:01:11","guid":{"rendered":"http:\/\/brightblog.wpengine.com\/?p=141"},"modified":"2021-01-21T09:17:23","modified_gmt":"2021-01-21T15:17:23","slug":"design-system-good-business","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/design-system-good-business\/","title":{"rendered":"Why Having a Design System is Good for Business"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">What do Atlassian, Shopify, IBM, AirBnB, Microsoft, MailChimp, Trello, BuzzFeed, Buffer, Apple, and Salesforce all have in common (besides being large, successful companies with strong brands)? They all use design systems to improve consistency and scalability (<\/span><a href=\"https:\/\/www.invisionapp.com\/blog\/design-systems\/\"><span style=\"font-weight: 400;\">source<\/span><\/a><span style=\"font-weight: 400;\">). Read on to discover what a design system is (if you don’t already know) and 10 benefits that it can offer your business.<\/span><\/p>\n<p><!--more--><\/p>\n<h2><img loading=\"lazy\" class=\"alignnone size-full wp-image-882\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2018\/09\/ubiwo074qlu.jpg\" alt=\"\" width=\"1600\" height=\"1067\"><\/h2>\n<h2><span style=\"font-weight: 400;\">First, What is a Design System?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A design system has two parts. The first is a centralized collection of components that can be used again and again. <\/span><span style=\"font-weight: 400;\">&nbsp;<\/span><span style=\"font-weight: 400;\">Components can include but are not limited to: colors, typography, imagery, sizing, spacing, buttons, modals, and forms. The second part is a set of clear standards which outline how the components should be used.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">With a design system, an organization establishes an official language and framework for the way they design and build products.<\/span><\/p>\n<p><a href=\"https:\/\/design.trello.com\/\"><span style=\"font-weight: 400;\">See Trello’s design system here!<\/span><\/a><\/p>\n<p><span style=\"font-weight: 400;\"><a href=\"https:\/\/solid.buzzfeed.com\/\">See BuzzFeed’s design system here!<\/a><\/span><\/p>\n<h2><span style=\"font-weight: 400;\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-144\" style=\"font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen-Sans, Ubuntu, Cantarell, 'Helvetica Neue', sans-serif;\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2018\/02\/design-system.gif\" alt=\"\" width=\"800\" height=\"600\"><\/span><\/h2>\n<h2><span style=\"font-weight: 400;\">What is a Design System NOT?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">A style guide or pattern library alone is not a design system. One can be a starting point, but the system requires both parts.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Now that you know what a design system is let’s dig into the benefits it can offer your business.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">10 Benefits of a Design System for Your Business <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Businesses will reap huge advantages when implementing a design system, both internally and externally. Here are the top 10 I’ve identified:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">5 External Benefits<\/span><\/h3>\n<h4><strong>Build a Strong Brand<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">Companies make products, but brands sell them. With so many options, buyers want a brand they can identify with, like, and trust. To create that presence, a brand must develop its position, personality, and mission. Then, they must communicate it and represent it to their target audience consistently. A design system makes that possible and efficient by streamlining the design process.<\/span><\/p>\n<h4><strong>Improve Design Quality<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">The quality of a design is also important to make a positive impression that drives a consumer to take action. A design system guides the designer to create according to very specific standards and rules. As a result, it is easier to create consistent designs of high-quality. More importantly, a design system can be an advocate for better design throughout your organization &#8211; bending and shaping the organization to focus on design when it normally wouldn&#8217;t.<\/span><\/p>\n<h4><strong>Create a Good First Impression Everytime<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">We all know how important first impressions are; if you don’t make a good one, you can lose a customer for good. No matter where your business meets your customers, the designs should be consistent and impactful. A design system ensures every piece of content that goes out is in alignment with the set standard. <\/span><\/p>\n<h4><strong>Be Memorable<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">Think of a brand. Got it? Okay, now think about why that brand is the first to come to your mind. It has achieved the goal of all brands; to be memorable. I thought of Apple, a leader amongst leaders. While Apple makes computers, phones, tablets, etc., it stands for much more than that; for creativity, innovation, and simplicity. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">When you are a “Mac-user” or and “iPhone-user” you are part of a community. For decades, the brand has communicated the same principles through its products, advertisements, and leadership. A design system helps you to create a memorable presence by making it easy to be consistent in all of your communications. <\/span><\/p>\n<h4><strong>Build Trust<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">Imagine two people. The first person frequently tries different styles of dress, is inconsistent with their stories, and is always chasing their next big idea (which changes monthly). The second person always has the same kind of style, has a consistent story, and has been working on a linear path toward the same goal for the past year. Which one would you trust more? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">A design system allows you to be the second person. You can pull all of the pieces of your company’s branding and communications together in one place, organize them, and move forward with a purposeful, unified plan. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">5 Internal Benefits (Using Design Systems)<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Now let’s talk about how a design system can impact your business internally. <\/span><\/p>\n<h4><strong>Increase Productivity and Collaboration<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">With a design system, your entire organization gains a framework to guide their actions. It provides clear guidelines which put everyone on the same page. Designers and others within the company are never starting from scratch. They all have a clear idea of the goal and the tools; all they have to do is insert creativity to create new products. This makes it easier for team members to work together and be more productive. <\/span><\/p>\n<h4><strong>Reduce Repetitive Work<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">When creating a design system, you will take inventory of all of your business’s design components. They will be organized, and duplicates will be removed. Then, these assets will be ready and available whenever someone needs them. There is no need to reinvent the wheel when it has been done time and time again. Team members can build on what has already been established. <\/span><\/p>\n<h4><strong>Improve Quality, Consistency, and Accessibility<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">A design system empowers organizations by removing obstacles that slow down the workflow. All of the instructions outlining what to do are easily accessible, and many of the puzzle pieces are ready and waiting to be used. This allows designers and other team members to create high-quality work that is consistent across all channels quickly.<\/span><\/p>\n<h4><strong>Make it Easier to Work with Partners<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">Need to bring in a third-party to assist with a project? You can get them up to speed quickly and easily by sending them your guidelines and granting them access to your components. No need to spend hours explaining your company and the message you want to convey because it’s all there already. This can save time upfront and help outsiders feel confident about the collaboration.<\/span><\/p>\n<h4><strong>Enable More Innovation<\/strong><\/h4>\n<p><span style=\"font-weight: 400;\">Have you ever been assigned a project with very little context or direction? Left to not only complete the project but to figure out the parameters? While it can grant some creative freedom, it takes a significant amount of time. On the other hand, when all of the pre-work is defined, it’s like starting ten steps ahead. As a result, you have more time and energy to invest in the core of the project itself. A design system provides that jumping point, creating more opportunities for innovation.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Design Systems are the Future of Successful Businesses<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Creating and implementing a design system is a natural step for many businesses in order to streamline and optimize their operations. The central design language enables a consistent customer experience. Further, with an evolving map of your brand’s components and guidelines, designers aren’t ever starting from square one. They have a foundation on which to build, with pointers to guide them towards the next step.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">If you would like to brand and scale your enterprise with confidence, speed up the creation process, and create more space for innovation, <a href=\"https:\/\/www.brightscout.com\/contact\/\">contact our expert team<\/a> at Brightscout to chat about your future design system! <\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What do Atlassian, Shopify, IBM, AirBnB, Microsoft, MailChimp, Trello, BuzzFeed, Buffer, Apple, and Salesforce all have in common (besides being large, successful companies with strong brands)? They all use design systems to improve consistency and scalability (source). Read on to discover what a design system is (if you don’t already know) and 10 benefits that [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":143,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[38],"tags":[],"yst_prominent_words":[676,715,251,85,84,323,706,270,283,292,665,642,64,655,734,63,751,304,647,255],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/141"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=141"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/141\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media\/143"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=141"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=141"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=141"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=141"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}