{"id":208,"date":"2017-11-06T20:32:29","date_gmt":"2017-11-06T20:32:29","guid":{"rendered":"http:\/\/brightblog.wpengine.com\/?p=71"},"modified":"2021-01-21T09:17:26","modified_gmt":"2021-01-21T15:17:26","slug":"conversational-ui-awesome","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/conversational-ui-awesome\/","title":{"rendered":"Conversational UI and Why It’s Awesome!"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Conversational UI (CUI) isn’t actually anything new. However, what is new is that the technology behind it has developed to the point where it’s become practical. For instance, artificial intelligence and natural language processing (NLP) enable over 90% accuracy in machine parsing and understanding requests that are typed or spoken. With this ability, it’s time to seriously consider how CUI can help your business. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Here’s a closer look at what CUI is exactly, and why it’s awesome!<\/span><\/p>\n<p><!--more--><\/p>\n<h2><span style=\"font-weight: 400;\">What is Conversational UI?<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Conversational user interfaces simulate chatting with a real human. For example, Microsoft’s Cortana, Facebook Messenger’s chatbot, and Apple’s Siri. They are programmed to understand the natural language of human users and to respond appropriately. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Two categories of CUI<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">You can split CUI into two categories: voice-driven interfaces and message platform-based interfaces. As you might guess, you interact with voice-driven interfaces by talking to them (like Siri) whereas you interact with message platform-based interfaces through typed messages (like Facebook Messenger chatbot). <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Bot types: Transactional vs. Conversational<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Beyond these categories, there are two main types of bots that enable CUI. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Transactional Bots<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The first is the transactional bot which relies on a script for conversations. It may use NLP to understand what the person is saying, and will respond from the script. Creating the script can be very challenging as writers try to think out the many directions a conversation can take. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Transactional bots can be helpful for achieving simple goals like booking a taxi or making an appointment. However, it can fall short when trying to respond to more complex interactions like talking about someone’s day.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">Conversational Bots<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">The second is a conversational bot which interprets input from users and responds with relative and intelligent dialogue. This is possible by inputting data to train the AI (i.e., chat scripts, web page copy, manuals, guides, email copy, etc.) which instruct it on how it should talk and what it should know. This process is much more complex but enables a more flexible and human-like interaction.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Why Conversational UI is Awesome<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">CUI opens up many possibilities for businesses and customers alike. Here are some of the top reasons we think it’s awesome:<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">It Enables Computers to Speak our Language<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">Conversational UI enables humans to directly tell computers what we want. Where before, we had to adapt our communication to the computer’s needs (clicking icons, entering specific commands, etc.), the computer is now adapting to ours. It will become more and more able to figure out what we want and then will do it for us.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">It’s Efficient<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In cases where you would need to interact with a crowded graphical user interface, select several UI elements, or move between screens to complete an action, conversational UI can create an easier alternative. Using a sentence, you can instruct the bot to take the several actions needed to complete a goal. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">It Can Work Pretty Much Anywhere<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">CUI can be implemented across many platforms. You can add it to a webpage, a service like social media, a chat platform, a mobile app, a wearable, an independent device, and more. This enables many new types of interactions that make life easier for users, and create opportunities for businesses.<\/span><\/p>\n<h3><span style=\"font-weight: 400;\">It Can Improve Customer Service<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">In the past, businesses had to rely on hiring more people to provide quality customer service. You needed people to answer phone calls, respond to emails, and respond to messages on social media. Now, CUI allows businesses to “be there” to engage or sell to a customer base 24\/7. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can add them in your social media platform messengers, in your apps, on your website, on your customer service phone line, and more. This can help to ease customer concerns and improve their overall experience. <\/span><\/p>\n<h3><span style=\"font-weight: 400;\">It’s Scalable and Can Cut Overhead Costs<\/span><\/h3>\n<p><span style=\"font-weight: 400;\">As CUI performs more functions with higher quality, it reduces the need for hiring people which cuts overhead costs. Further, it can more easily scale with your business.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">The Future is in Conversational UI<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">There’s no question about CUI; it will continue to advance, improve, and be used in more products, programs, and services. Brightscout can help your business utilize this technology to enhance your communication and productivity. If you’d like to learn more, contact our experts at (contact number). <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Stay tuned next week for 10 examples of Conversational UI in action!<\/span><\/p>\n<p>[contact-form to=&#8221;sales@brightscout.com&#8221; subject=&#8221;Blog Contact Alert!&#8221;][contact-field label=&#8221;Name&#8221; type=&#8221;name&#8221; required=&#8221;1&#8243;][contact-field label=&#8221;Email&#8221; type=&#8221;email&#8221; required=&#8221;1&#8243;][contact-field label=&#8221;Website&#8221; type=&#8221;text&#8221;][contact-field label=&#8221;Message&#8221; type=&#8221;textarea&#8221; required=&#8221;1&#8243;][\/contact-form]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Conversational UI (CUI) isn’t actually anything new. However, what is new is that the technology behind it has developed to the point where it’s become practical. For instance, artificial intelligence and natural language processing (NLP) enable over 90% accuracy in machine parsing and understanding requests that are typed or spoken. With this ability, it’s time [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":74,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[33],"tags":[],"yst_prominent_words":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/208"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=208"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/208\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/pages\/74"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=208"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=208"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=208"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=208"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}