{"id":209,"date":"2017-11-14T22:58:04","date_gmt":"2017-11-14T22:58:04","guid":{"rendered":"http:\/\/brightblog.wpengine.com\/?p=77"},"modified":"2021-01-21T09:17:26","modified_gmt":"2021-01-21T15:17:26","slug":"10-apps-use-conversational-ui","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/10-apps-use-conversational-ui\/","title":{"rendered":"10 Apps that Use Conversational UI"},"content":{"rendered":"<p>Last week, we introduced what <a href=\"https:\/\/blog.brightscout.com\/conversational-ui-awesome\/\">Conversation UI is, how it works, and why it’s awesome<\/a>. Now, let’s look at it in action. Here are 10 apps that illustrate how CUI can be used across many industries and to varying extents.<\/p>\n<p><!--more--><\/p>\n<h3>1. <a href=\"https:\/\/qz.com\/app\/\">Quartz News App<\/a><\/h3>\n<p>The Quartz app’s interface is noticeably different from other news apps in that instead of scrolling through a graphical interface of stories; it’s you and the bot having a conversation.<\/p>\n<p>The messages from Quartz tell you about the latest news stories in the form of text, photos, GIFs, links, and even 3D objects that are viewable in augmented reality. Once you receive a message, you decide if you want to hear more about that particular story or not. Further, you can decide which alerts you want to receive or if you want to snooze them temporarily.<\/p>\n<p>This app was voted one of the best iPhone apps of 2016 and received several other accolades. It aims to be a more personal and convenient way for users to stay in the loop.<\/p>\n<h3>2. <a href=\"https:\/\/www.pennyapp.io\/\">Penny Personal Finance App<\/a><\/h3>\n<p>Penny is a personal finance bot that lives in the Penny App. Through a chat-based interface, users talk with the light-hearted Penny to get insights on their finances and tips on how to reach their goals.<\/p>\n<p>The way it works is, the user connects their bank and\/or credit card account(s) and then Penny can provide alerts, analysis, and answers to questions. The main goal of app creator Friendly Finances, Inc. is to make managing finances more user-friendly and less intimidating for people.<\/p>\n<h3>3. <a href=\"https:\/\/itunes.apple.com\/us\/app\/duolingo\/id570060128?mt=8\">Duolingo Language Learning App<\/a><\/h3>\n<p>Duolingo is an app to help users learn a new language, and it has over 200 million users. It offers bite-sized lessons that get progressively harder as you advance. Additionally, there is a section where you can practice having a real conversation with the help of bots. The bots react differently to thousands of possible answers.<\/p>\n<p>Often the hardest part of learning a language is practicing. The Duolingo Bot can help remove that obstacle, reinforcing the users’ newly-learned knowledge.<\/p>\n<h3>4. <a href=\"https:\/\/www.web.lark.com\/\">Lark Healthcare App<\/a><\/h3>\n<p>Lark is a virtual coaching platform that helps healthcare organizations to prevent and manage chronic diseases in their members such as diabetes and hypertension. It does so using AI made after six years of research and development with the world’s top health and behavior experts from Harvard and Stanford.<\/p>\n<p>How does it work? Take, for example, a person with high blood pressure. Lark will send the person a blood pressure monitor. The AI will track and analyze the data from the monitor. Then, it will send messages to update the person on how they are doing; high, low, or on track. It will also provide tips on how to improve, will send reminders, and is able to connect the person to a live nurse if needed.<\/p>\n<p>The Lark App provides members with more personal attention and care while saving care teams an average of 80% in operational and medical costs. Further, it provides organizations with unprecedented amounts of data about their members.<\/p>\n<p>Lark’s Health AI has been named the best app of 2016 by Google and the company was named one of the “Top 10 Most Innovative Companies in the World” by Business Insider. What’s even more interesting is that the CDC formally recognized Lark’s diabetes program as capable of fully replacing a live health care professional.<\/p>\n<h3>5. <a href=\"https:\/\/operator.com\/\">Operator Mobile Commerce App<\/a><\/h3>\n<p>Operator is a shopping app that was created by Uber’s co-founder Garrett Camp. It allows users to search for specific products by sending a text message. Further, users can chat with bots for answers to general questions or shopping experts for help with more specific questions.<br \/>\nIt aims to be the third wave of commerce, where you can buy from home but with the personal assistance as if you were in a brick-and-mortar store. Chatbots and humans work together to help Operator reach this goal.<\/p>\n<h3>6. <a href=\"https:\/\/www.starbucks.com\/coffeehouse\/mobile-apps\">Starbucks Retail App<\/a><\/h3>\n<p>The Starbucks iPhone app allows you to do many things like find stores, earn rewards, send gifts, and, as of earlier this year, order by interacting with a chatbot. The AI assistant’s name is “My Starbucks barista.”<\/p>\n<p>In addition to taking orders, it can also clarify menu items and prices. After the order is placed, the bot confirms the pick-up location and payment method before sending it to the designated store. This helps to streamline the ordering and customer service process for Starbucks; maybe too good as baristas reported getting backed up in making drinks as a result.<\/p>\n<h3>7. <a href=\"https:\/\/www.woebot.io\/\">Woebot Mental Health App<\/a><\/h3>\n<p>The Woebot app houses a talk therapy chatbot developed by a team of AI experts and Stanford psychologists. It helps people to manage their mental health through games, curated videos, questions, daily conversations, and mood tracking. While it mostly asks questions, it can provide personal responses for up to 10 minutes and does so by tracing branches of a decision tree.<\/p>\n<p>The creators say that this can help those who don’t have the time, money, or desire to speak with a human therapist. Further, it offers anonymity that is not available when speaking with another human; no fear of judgments.<\/p>\n<h3>8. <a href=\"https:\/\/www.uber.com\/newsroom\/messengerlaunch\/\">Uber: Ridesharing in Facebook Messenger<\/a><\/h3>\n<p>Uber has transformed transportation since its launch in 2009 and decided to make it even easier for people to request rides at the end of 2015. Using it’s own API, Uber enabled the requesting of rides within Facebook Messenger.<\/p>\n<p>There’s no longer the need to download the Uber app or even leave FB Messenger. Once a ride is ordered, the Uber bot will send you messages to confirm your request and let you know the status of your ride.<\/p>\n<h3>9. <a href=\"https:\/\/allo.google.com\/\">Google Allo: Messaging App with @google<\/a><\/h3>\n<p>Allo is an instant messaging mobile app that was released at the end of last year; September 2016. Within the app is an AI digital assistant you can interact with by typing @google. As the main player in the search engine arena, Google has some know-how when it comes to machine learning and search.<\/p>\n<p>Simply ask the chatbot anything you need to know while in a conversation (i.e., movie times, directions, how to make sushi, etc.) and get a quick answer.<\/p>\n<h3>10. Bank of America Finance Management App<\/h3>\n<p>Lastly, Bank of America is <a href=\"https:\/\/www.cnbc.com\/2016\/10\/24\/bank-of-america-launches-ai-chatbot-erica--heres-what-it-does.html\">creating its own bot named Erica<\/a> to help customers make smart financial decisions. Users will find Erica in the mobile app and can chat with her via text message or voice. She will analyze spending, make suggestions, make payments, check balances, and more.<\/p>\n<p>The bank says she’ll help them to expand their one-on-one customer service and will offer advice to all that is usually restricted only to top-tier customers.<\/p>\n<p>What do you think? Pretty cool, right? We think so. Conversational UI is disrupting many industries and enabling a new level of service, scalability, and even savings that weren’t previously possible.<\/p>\n<h3>How Can a Conversational UI Enhance Your App?<\/h3>\n<p>At Brightscout, we can help you bring your bot ideas to life. If you would like to talk with experts about integrating Conversational UI into your app, give us a call at (phone number) or head over to our <a href=\"https:\/\/www.brightscout.com\/contact\/\">contact page<\/a>.<\/p>\n<p>[contact-form][contact-field label=&#8221;Name&#8221; type=&#8221;name&#8221;  required=&#8221;true&#8221; \/][contact-field label=&#8221;Email&#8221; type=&#8221;email&#8221; required=&#8221;true&#8221; \/][contact-field label=&#8221;Website&#8221; type=&#8221;url&#8221; \/][contact-field label=&#8221;Message&#8221; type=&#8221;textarea&#8221; \/][\/contact-form]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week, we introduced what Conversation UI is, how it works, and why it’s awesome. Now, let’s look at it in action. Here are 10 apps that illustrate how CUI can be used across many industries and to varying extents.<\/p>\n","protected":false},"author":2,"featured_media":79,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[33],"tags":[],"yst_prominent_words":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/209"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=209"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/209\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=209"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=209"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=209"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=209"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}