{"id":211,"date":"2017-12-05T21:48:10","date_gmt":"2017-12-05T21:48:10","guid":{"rendered":"http:\/\/brightblog.wpengine.com\/?p=97"},"modified":"2021-01-21T09:17:25","modified_gmt":"2021-01-21T15:17:25","slug":"5-fintech-companies-using-blockchain-tech","status":"publish","type":"post","link":"https:\/\/www.brightscout.com\/5-fintech-companies-using-blockchain-tech\/","title":{"rendered":"5 FinTech Companies Using Blockchain Tech"},"content":{"rendered":"<p>The influence of FinTech is growing quickly, and it is disrupting many industries. According to the <a href=\"https:\/\/www.pwc.com\/gx\/en\/industries\/financial-services\/assets\/pwc-global-fintech-report-2017.pdf\">2017 Global FinTech Report<\/a> by PwC, 55% of respondents in the financial services sector expect to adopt blockchain as part of an in-production system or process by 2018 and 77% by 2020. We can already see familiarity with the technology is increasing, especially in North America.<\/p>\n<p>With mass blockchain adoption on the horizon, let’s take a look at 5 FinTech companies that are ahead of the curve.<\/p>\n<p><!--more--><\/p>\n<h3>1. Cryptopay<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-874\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2017\/12\/fb_cover.jpg\" alt=\"\" width=\"3280\" height=\"1688\"><\/p>\n<p><a href=\"https:\/\/cryptopay.me\/\"> Cryptopay<\/a> offers a mobile application (available in the App Store and Google Play Store) that enables users to easily manage their bitcoins. You can convert them into US dollars, Euros, or British Pounds, send them to friends, and get a prepaid debit card so you can withdraw money from ATMs and use it to make purchases.<\/p>\n<p>The card serves as a much-needed connection between Bitcoin and traditional finances and is accepted alongside all major credit cards. Further, the ability to convert your bitcoins enables you to secure your money against fluctuations in the market.<\/p>\n<p>As of this writing, Cryptopay has 598,577 active users and has issued 112,549 prepaid cards.<\/p>\n<h3>2. LAToken<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-875\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2017\/12\/latoken-main-banner2.png\" alt=\"\" width=\"1176\" height=\"480\"><\/p>\n<p><a href=\"https:\/\/latoken.com\/\">LAToken<\/a> is crypto trading platform that enables you to trade bitcoins on a global scale, tokenize and sell your assets, list your token, and make an initial coin offering (ICO) out of your project. Its main function is to serve as a bridge between the real and crypto economy, enabling real assets to be traded in crypto.<\/p>\n<p>The way it works for tokenizing assets such as commodities, art, debt, equity, or real estate is asset owners sell part of the asset to a custodian certified by LAToken. The custodian then provides asset tokens equivalent to the value of the assets. Those are then sold to cryptoholders. (Note: You can also opt to be the cryptoholder buying tokens linked to real assets.) The cryptoholders may then sell the tokens on a secondary market. A settlement date is set on which the asset owner buys back the asset tokens, or the token holders receive the proceeds from the custodian selling the asset at a flat auction.<\/p>\n<p>As for the trading side, crypto holders can buy asset tokens at an auction on the platform which are connected to publicly traded assets. On the settlement date, LAToken will buy back the asset tokens at the current market price of the asset.<\/p>\n<p>Because crypto holders buy LAT to purchase asset tokens and pay for transactions, the demand is correlated with the LAT Platform trading volume. Currently, LAToken’s global asset value sits at $517 trillion while their global trading volume is at $155 trillion.<\/p>\n<h3>3. Abra<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-877\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2017\/12\/Abra-and-Amex-join-forces-with-bitcoin-final_revised-1.png\" alt=\"\" width=\"4662\" height=\"3297\"><\/p>\n<p><a href=\"https:\/\/www.abra.com\/\">Abra<\/a> is another mobile app, and it allows you to easily buy and sell Bitcoin as well as send and store it. You start by funding your Abra wallet using your bank account or credit card. Then, you will be able to convert it into Bitcoin.You can store your bitcoins in the wallet and will have total control of them at all times as it’s non-custodial.<\/p>\n<p>When you want to do business, you can send and receive bitcoins, as well as pay merchants with them. Further, you are not limited to Bitcoin, there are also more than 50 other currencies you can choose from, and your recipients can choose how to receive their money.<\/p>\n<h3>4. Populous<\/h3>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-878\" src=\"https:\/\/www.brightscout.com\/wp-content\/uploads\/2017\/12\/img-home-banner-world@2x.png\" alt=\"\" width=\"1096\" height=\"726\"><\/p>\n<p><a href=\"https:\/\/populous.co\/index.html\">Populous<\/a> is a new global invoice trading platform that connects invoice buyers and business owners around the world. It is built on Blockchain’s distributed ledger technology which enables<br \/>\nunprecedented security, global transactions, immediate funding, and low costs.<\/p>\n<p>Here’s how it works; the borrower offers an invoice with set terms, an investor chooses to finance the invoice, and the investor then bids on it and proposes the interest rate. If the borrower accepts the bid, they will confirm that the invoice is sold. The borrower then releases the invoice, and the investor receives returns when it is settled.<\/p>\n<h3>5. AID: Tech<\/h3>\n<p>&nbsp;<br \/>\n<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/5QkW9xAemtw\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"><\/iframe><\/p>\n<p><a href=\"https:\/\/aid.technology\/\">AID: Tech<\/a> enables secure and transparent delivery of digital entitlements (such as donations, Welfare, and remittances) via blockchain technology and digital identity. It is designed for organizations that provide critical resources to recipients around the world.<\/p>\n<p><strong>Key features include:<\/strong><\/p>\n<ol>\n<li>Transactions that are secured using a distributed ledger<\/li>\n<li>All transactions are permanently recorded and traceable<\/li>\n<li>Instant verifiability of all transactions<\/li>\n<li>The inability for records to be manipulated on the distributed ledger.<\/li>\n<\/ol>\n<p>The company aims to solve the problems regarding inefficiencies and illicit practices related to digital entitlements, citing that 2.4 billion people in the world do not have legal identities and 2 billion don’t have access to formal financial services.<\/p>\n<p>So far AID:Tech has delivered $143 billion in total development aid.<\/p>\n<h3>Blockchain Is In Our Future<\/h3>\n<p>After seeing the advantages that blockchain is able to provide for companies and their customers, it is no wonder the majority of financial companies have adoption on their radar. It presents unrivaled security, reach, and speed. The old ways simply won’t be able to keep up and compete. If you’d like to learn more about how you can utilize the power of the blockchain in your business, <a href=\"https:\/\/www.brightscout.com\/contact\/\">contact our experts at Brightscout today<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The influence of FinTech is growing quickly, and it is disrupting many industries. According to the 2017 Global FinTech Report by PwC, 55% of respondents in the financial services sector expect to adopt blockchain as part of an in-production system or process by 2018 and 77% by 2020. We can already see familiarity with the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":102,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"yst_prominent_words":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/211"}],"collection":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/comments?post=211"}],"version-history":[{"count":0,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/posts\/211\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/media?parent=211"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/categories?post=211"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/tags?post=211"},{"taxonomy":"yst_prominent_words","embeddable":true,"href":"https:\/\/www.brightscout.com\/wp-json\/wp\/v2\/yst_prominent_words?post=211"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}